export const privacyText = `
מדיניות פרטיות זו מתארת את האופן שבו היישום Rega משתמש במידע שנמסר על ידך במסגרת שימושך ביישום או אשר נאסף במסגרת שימושך ביישום.

כאשר את/ה עושה שימוש ביישום, בין באמצעות מחשב, טלפון סלולארי או כל אמצעי אחר, מידע אודות שימושיך עשוי להיות נאסף על ידנו, כגון: תאריכי ושעות כניסתך ליישום, הדפים בהם ביקרת, זמן שהייתך ביישום, המוצרים שהזמנת ועוד.

כאשר את/ה עושה שימוש ביישום את/ה נותנ/ת את הסכמתך לאיסוף מידע, ניתוחו, שמירתו, עיבודו, וגילויו בכפוף לתנאי מדיניות פרטיות זו.

בכל רגע נתון, באפשרותך לבקש למחוק את חשבונך לרבות כל פרטיך האישיים ופרטי ההתקשרות איתך וכמו כן את הסטוריית השימוש שלך. ניתן לבקש זאת ע״י שליחת מייל ל hello@rega.co.il המחיקה תבוצע עד שלושה ימי עסקים מקבלת המייל.

אנו עשויים להשתמש ב"עוגיות" (cookies) או טכנולוגיות דומות, העושות שימוש בקובץ שאנו שולחים לאמצעי שבעזרתו את/ה מתחבר/ת ליישום. קובץ זה, אשר גלוי לנו ויש לנו רשות כניסה אליו, אוגר מידע על אופן שימוש באמצעי שברשותך והדבר מסייע לנו להתאים את היישום טוב יותר אליך. אנו עשויים לטמון בקובץ זה גם מידע משלנו לשם מטרה זו. לרוב יש לך האופציה לחסום את השימוש ב"עוגיות" באמצעות התוכנה שבעזרתה את/ה גולש/ת ליישום, אבל הדבר עלול לפגוע באופן השימוש ביישום.

מבלי שיהא בכך לזהות אותך או המשתמש בפני צדדים שלישיים, אנו רשאים להשתמש במידע שנאסף תוך כדי שימושך ביישום ואף לשלבו עם מידע אחר אודותיך, בעצמנו ו/או באמצעות צדדים שלישיים, הפועלים מטעמנו, לשם ביצוע ניתוחים ופילוחים סטטיסטיים ושיווקיים, לשם פיתוח שירותים, פירסום ומשלוחו אליך או לאחרים, שיווק, ו/או מתן הצעות שונות שלא בהכרח ביחס לשירותינו.

אנו רשאים למסור ללא קבלת רשות ממך את המידע לרבות מידע המזהה אותך לצדדים שלישיים כלשהם על מנת לעשות בו שימוש במקרים הבאים: לשם בקרה/שמירה על תקינות ו/או טיב מערכותינו ו/או השירות ולהגנה על פעילותנו ופעילות לקוחותינו, בקרה על קיום הוראות כל דין, לצרכי אספקת שירותינו לרבות ניהולם, פיתוחם, שיווקם, הגנה על זכויותינו או זכויות מי שקשור בנו, גביית כספים והפקת חשבונות.
ככל שנתת הסכמתך לקבלת פירסומות מסחריות או אחרות ו/או עדכונים ו/או חומר שיווקי כלשהו הנוגע לעסקינו, את/ה לא תבוא בכל טענה כלפינו, אם בקבלת החומרים הנדונים יש בה משום פגימה בהנאתך מהשימוש באתר או השגת גבול או חדירה לפרטיותו. על אף האמור לעיל בתת סעיף זה, את/ה רשאי לבקש מעימנו באמצעות פנייה למוקד השירות שלנו, כי לא ישלחו אליך דברי פרסומת שעל משלוחם חל סעיף 30א לחוק התקשורת (בזק ושידורים), התשל"ב- 1982.
למען הסר ספק יובהר, כי אין בהוראות פרק זה כדי לגרוע ו/או למצות מזכויותינו לאסוף, להשתמש ו/או למסור מידע על פי כל דין, וכי הוראות פרק זה באות להוסיף על הוראות כל דין.
למען הסר ספק, אין באמור לעיל כדי למנוע מאת החברה להענות לכל הוראה מאת רשות מוסמכת למסור ולהעביר אליה מידע אודותיך.

שימוש במיכאל:

איסוף ושימוש בנתונים: אנו אוספים מידע מסוים מהאינטראקציות שלך עם מיכאל, כגון השאלות שלך, התגובות שלך וכל מידע אישי שאתה משתף מרצון. נתונים אלה משמשים אך ורק לשיפור הפונקציונליות של Michael, להתאמה אישית של החוויה שלך ולמתן תמיכה טובה יותר. איננו מוכרים, סוחרים או משכירים את המידע האישי שלך לשום צד שלישי.
אבטחת נתונים: אנו משתמשים באמצעי אבטחה בתקן התעשייה כדי להגן על המידע שאתה משתף עם מיכאל. זה כולל הצפנת נתונים במעבר ובמנוחה, שרתים מאובטחים וביקורות אבטחה שוטפות. עם זאת, שים לב ששום שיטה להעברה או אחסון דיגיטלי אינה מאובטחת ב-100%, ואיננו יכולים להבטיח אבטחה מוחלטת.
אנונימיות: אינך נדרש לספק מידע המאפשר זיהוי אישי כדי ליצור אינטראקציה עם מיכאל. אתה יכול להשתמש בשירות באופן אנונימי, ו-מיכאל לא ינסה לזהות אותך על סמך האינטראקציות שלך. עם זאת, אם תבחר לשתף מידע אישי, הוא יטופל בהתאם למדיניות פרטיות זו.
שירותי צד שלישי: מיכאל עשוי להשתמש בשירותי צד שלישי, כגון ממשקי API לעיבוד שפה טבעית, כדי לתפקד כראוי. לשירותים אלו יש מדיניות פרטיות משלהם, ואנו ממליצים לך לבדוק אותן. איננו אחראים למדיניות הפרטיות של שירותי צד שלישי אלה.
שימור ומחיקה: אנו שומרים את המידע שנאסף מהאינטראקציות שלך עם מיכאל כל עוד יש צורך לספק את השירות ולשפר את הביצועים שלו. אם ברצונך למחוק את הנתונים שלך, תוכל לבקש זאת על ידי יצירת קשר בכתובת hello@rega.co.il. נעשה כל מאמץ למחוק את הנתונים שלך בהקדם, אך שים לב שחלק מהנתונים השיוריים עשויים להישאר במערכות הגיבוי.


פרטיות ילדים: מיכאל אינו מיועד לשימוש ילדים מתחת לגיל 13. איננו אוספים ביודעין מידע אישי מילדים. אם נודע לנו שילד סיפק לנו מידע אישי, ננקוט צעדים כדי למחוק אותו. אם אתה מאמין שאספנו מידע מילד, אנא צור איתנו קשר מיד.
`;
