export const tosText = `
1.כללי

1.1.יישום זה בבעלות ומופעל על ידי ״רגע״ (להלן "היישום" ו- "אנו"), שכתובתו האלקטרונית היא: hello@rega.co.il לשם קבלת פניות אלינו ביחס ליישום.
1.2.השימוש ביישום וכל הנלווה לו כפוף לתנאים המנויים מטה. אנא קרא/י בעיון תנאים אלו. אם אינך מסכים/ה לתנאי מתנאים אלו, הנך נדרש/ת שלא לעשות שימוש ביישום. שימושך ביישום, ייחשב על כן, להסכמה לתנאים אלו.
1.3.אם אינך בגיל חוקי, המאפשר לך להתחייב ולקבל תנאים אלו, אל תשתמש/י ביישום זה. אם יסתבר לנו, כי אינך בגיל חוקי מתאים כאמור, אנו שומרים לעצמנו האפשרות למנוע ממך שימוש ביישום או בחלקיו.
1.4.מטעמי נוחות הפנייה במסגרת יישום זה היא בלשון זכר יחיד, אולם היא מיועדת לנשים וגברים כאחד, יחיד ורבים.
1.5.סטייה ולו חלקית מתנאי השימוש של היישום עלולה להסתיים בחסימה, או בהגבלת השימוש באתר או חשבונך לרבות ביטולו על ידינו. מוסכם בין הצדדים כי כל הפרה של תנאי מתנאי שימוש אלו מהווה הפרה יסודית של תנאים אלו.
1.6.ככל שנהיה בדעה כי הפרת את תנאי שימוש אלו, אתה מתחייב להסיר לבקשתנו את היישום ממכשירך.
1.7.מדיניות הפרטיות שביישום מהווה חלק בלתי נפרד מתנאי שימוש אלו.
  
2.מהות היישום

2.1.היישום מאפשר למשתמשיו להנות מחוויית התנסות במיינדפולנס.
2.2.היישום אינו מהווה טיפול מכל סוג שהוא. הוא אינו מתיימר להוות פתרון נפשי, גופני או רפואי לדבר. אם הינך סובל מבעיות נפשיות, עליך להתייעץ עם איש מקצוע בטרם תעשה שימוש ביישום.
2.3.לא כל הפעילויות הנוגעות ליישום מתאימות לכל אדם, אנא הפעילו שיקול דעת בעת שאתם משתמשים ביישום. השימוש ביישום הוא על אחריותך המלאה.
2.4.לא מומלץ להשתמש ביישום בעת נהיגה, ובכל מסגרת שבה נדרש ריכוז ותשומת לב גבוהה.
2.5.היישום מותר לבני 18 שנים ומעלה בלבד. שימוש בישום על ידי מי שצעיר מגיל 18 כפוף לאישור מאת האפוטרופוס החוקי שלו.
2.6.הישום ניתן להורדה בחנויות האפליקציות שבחרנו להפיץ את היישום באמצעותן.
2.7.מתן רשות השימוש ביישום הינה כנגד תשלומים המשולמים באמצעות חשבונך בחנות האפליקציות או באתר לפיכך, במידה והנך מעונייך לבצע רכישה דרך חנות האפליקציות, כדי להנות מהיישום עליך להמשיך להיות מנוי בחנות אפליקציות זו.
2.8.ההסכמים שבינך לבין חנות האפליקציות עשויים לחול גם ביחס לשימוש ביישום ולתשלומים עבורו בנוסף על תנאי שימוש אלו. הפרת ההסכמים עם חנות האפליקציות לפי ראות עיני חנות האפליקציות עלולה למנוע ממך את השימוש ביישום, והינך מתחייב לכבד הסכמים אלו.
2.9.לצורך שימוש ביישום עליך על חשבונך: להצטייד במכשיר העונה על הדרישות המינימליות הטכניות של היישום ולחבר את מכשירך אל רשת האינטרנט.
  
3.פתיחת חשבון

3.1.לשם השימוש ביישום, תידרש לפתוח חשבון במסגרת היישום, הכרוך בשם משתמש ובסיסמא. רק אדם מעל גיל 18 מורשה לפתוח חשבון לצורך היישום.
3.2.עליך לשמור בסודיות את שם המשתמש והסיסמא.
3.3.הינך מחויב להודיע לנו באופן מיידי, אם את/ה חושד/ת שמישהו עושה שימוש בלתי מורשה באמצעות חשבונך אצלנו.
3.4.אנו לא נהיה אחראים לשימוש בלתי מורשה של צדדים שלישיים בחשבונך ולתוצאות שימוש בלתי מורשה זה.
3.5.מבלי לגרוע מכלליות תנאים אחרים, הינך מתחייב, כי הינך בן 18 ומעלה ושהפרטים שהינך מוסר לנו לצורך פתיחת החשבון הינם אמיתיים, עדכניים ומדויקים.
3.6.אינך מורשה לאשר לאחר לעשות שימוש בחשבונך.
3.7.יתכן שהיישום יאפשר פתיחת חשבון באמצעות פלטפורמות אחרות שבהן קיים חשבון על שימך, כגון: פייסבוק וגוגל פלוס. אף במקרה זה עליך לוודא שהפרטים והתכנים כגון: תמונתך, המועברים מפלטפורמות אלו הינם נכונים ומדוייקים; הינך מעניק לנו בהשתמשך באופציה זו לעשות שימוש במסגרת היישום בכל אותם פרטים ותכנים בהתאם לתנאי שימוש אלו, לרבות פרסומם ביישום.
3.8.הינך רשאי בכל עת להודיע על בקשתך כי חשבונך יוסר מהיישום על ידנו. אולם הסרת החשבון איננה מסירה את האפליקציה ממכשירך או מבטלת את החיובים מצידה של חנות האפליקציות או מצד האתר – לשם הסרת האפליקציה והפסקת התשלומים עליך לפעול בהתאם לתנאים ולהוראות שבחנות האפליקציות או לפנות אלינו במייל hello@rega.co.il במידה והתשלום בוצע דרך האתר.
3.9.הסרת חשבונך עלולה להוביל לאובדן כל המידע שנשמר בחשבונך.
  
4.תשלומים

4.1.התשלומים בגין רשות השימוש ביישום משולמים לחנות האפליקציות בהתאם להסכמים שבינך לבין חנות זו או דרך האתר.
4.2.אנו איננו אחראים על גביית התשלומים, ואיננו מעניקים זיכויים או החזרים מכל סוג שהוא לך, אף אם הועברו אלינו כספים מאת חנות האפליקציות כאשר בוצע תשלום דרך חנות האפליקציות . תשלום למנוי שבוצע דרך האתר ניתן לבטל תוך 14 יום מיום ביצוע התשלום.
4.3.מובהר, למרות כל האמור לעיל, כי שיעור התשלומים עלול להשתנות מעת לעת.
4.4.אי שימוש ביישום, שימוש חלקי בו לרבות מפאת הסרת היישום בטרם סיום תקופת החיוב לא יקנה לך כל עילה לזיכוי כלפינו או כלפי חנות האפליקציות.
4.5.תשלום דרך האתר, כמו דרך האפליקציה יתחדש אוטומטית בסיום המנוי, עם זאת, תוכל לבטל את החידוש לפחות 24 שעות לפני סוף תקופת החיוב הנוכחית. במידה והפסקת את התשלומים החוזרים דרך האתר, הגישה שלך למדיטציות הפתוחות בסיום התקופה תחלוף במקום להתחדש, ולא תחוייב שוב. במידה ושילמת דרך האתר, ניתן לבטל את המנוי דרך האתר.
  
5.ניהול היישום ושימוש בו

5.1.אנו שומרים לעצמנו הזכות לשנות את היישום, לעצבו מחדש, להוסיף או לגרוע ממנו, ללא אישור ממך.
5.2.הינך מתחייב/ת שלא להתערב בפעולתו של היישום על כל חלקיו, שלא לצור עומס על מערכות היישום, ושלא לבצע כל מעשה שיש בו כדי לפגוע בשימושם של אחרים ביישום או בפעילותו השגרתית.
5.3.השימוש ביישום נועד לשימוש אישי, פרטי, סביר והוגן. הפעלה בפומבי של היישום עבור קבוצת אנשים איננה מותרת.
5.4.השימוש ביישום מותנה בכך שהינך באופן כנה מעוניין להתנסות במדיטציה. "דייג נתונים" או בדיקות שיווקיות, סטטיסטיות או מחקריות אחרות אסורים באמצעות יישום זה..
5.5.אל לך לעשות דבר שיש בו להוות עקיפה של תנאי שימוש אלו או של מנגנונים טכנולוגים הקיימים ביישום או כדי לסייע לדבר, או כשיש בו כדי לפגוע או להתערב בפעולת מערכות היישום, תכונותיו, יישומיו, וכיוב' מאפיינים הקיימים ביישום. אנו נהיה רשאים להגביל שימושך ביישום ככל שיתעורר חשד אצלנו למעשים מסוג זה.
5.6.אל לך לעשות שימוש בכל כלי, תוכנה, מערכת, אלגוריתם, רובוט, שיטה, אמצעי אוטומטי או מתוכנת אחר למעט מערכת ההפעלה הסטנדרטית של אנדרואיד או אפל על מנת לגשת אל היישום. אין להעתיק תכנים מהיישום באמצעים אלו ואין לחדור באמצעותם ליישום או אל מנגנוניו, ואין לעשות כל שימוש או העתקה של הקוד המוטמע בו.
5.7.אינך מורשה לבצע כל שימוש בתכנים המופיעים ביישום ללא אישור מפורש ובכתב מעימנו.
5.8.על אף שאנו נוקטים בצעדים שונים על מנת לשמור על המידע המועלה על ידך ליישום, איננו יכולים להיות ערבים, כי לא תהיה חדירה בלתי מורשית אל המידע הנ"ל, והינך לוקח/ת את כל הסיכונים הכרוכים בהעלאת מידע זה. כמו כן, איננו ערבים לכך שלא תהא חדירה בלתי מורשית למערכות היישום או למערכות אחרות שלנו.
5.9.אנו רשאים לסגור את היישום, למכרו למפעילים אחרים, לשנות את ייעודו, להפוך חלקים מהיישום או את כולו לנגישים לקבוצה מצומצמת יותר.
5.10.אנו רשאים להתנות בתשלומים נוספים גישה לחלקים מהיישום או לכולו, או להתנות בתשלום שימוש בתכונות, שירותים או אמצעים הקיימים בו כעת ללא בתשלום או ללא תשלום נוסף.
5.11.אנו רשאים להפסיק את התמיכה האנושית ו/או האוטומטית אשר מספק היישום בחלקים ממנו, להפסיק זמנית או באופן קבוע קיומם של שירותים מסויימים, תפקודים שונים או חלקים מהיישום, והנך מאשר/ת כי אין לך ולא תהיה לך כל טענה כנגדנו בשל זאת.
5.12.אנו מעת לעת עשויים לפי שיקול דעתנו המוחלט להפיץ עדכונים ליישום, שהורדתם על ידך מחנות האפליקציה חיונית לשם הנאה מלאה מהיישום.
  
6.קניין רוחני

6.1.כל זכויות היוצרים הכרוכים ביישום ובמה שמצוי בו לרבות סימני מסחר, וידאו, מוזיקה, תמונות, עיצובים גרפיים, עימוד היישום, סידור התכנים וכיוב', שייכים לנו או לאחרים, שנתנו לנו רשות בהם. הנך מתחייב/ת שלא לשנות, להתערב, להעתיק, לשכפל, להנדס לאחור, להעביר, לשלב, להשתמש לצורך מסחרי, לשדר, להציגו בפומבי, לעבד או להפיץ כל חלק מהיישום או תוכן המצוי בו.
6.2.אינך מורשה/ית ליצור קישוריות אל היישום מיישום אחר, או לבצע כל סוג של מסגור (FRAMING) או הטמעה (EMBEDING) ביישום אחר ביחס לתכני יישום זה.
6.3.ביישום ניתן לך רישיון שימוש זמני, בלתי אקסלוסיבי, בלתי ניתן להעברה, המוגבל להורדתו למכשיר אחד בלבד ולהתקנתו במכשיר זה, הכול בכפוף לתנאי שימוש אלו.


7.אחריות ושיפוי

7.1.יישום זה על כל חלקיו, תכונותיו, ישומיו, שירותיו ותכניו, הינו כמו שהוא וללא כל אחריות. אנו איננו מבטיחים ביחס ליישום וחלקיו: זמינות מלאה, תפקוד תקין או תפקוד כלשהו, העדר תקלות או הפרעות לרבות מחיקת מידע וקריסה, יעילות, היקף חשיפות, הופעה נאותה בכל הדפדפנים, המסכים או ההתקנים או כל מימד אפקטיביות אחר או כי המידע בו מדוייק, או נטול טעויות. אין אנו מבטיחים, כי ניתן להסתמך על המופיע ביישום או על שירותיו. אנו דוחים כל טענה בדבר כשירות היישום או התאמתו למטרות מסוימות. השימוש ביישום הוא באחריותך בלבד. אנו בכל מקרה, לא נהיה אחראים: לכל נזק תוצאתי או עקיף, להפסדים ולאובדן מידע.
7.2.למרות שהננו נוקטים באמצעי אבטחה ביישום, אנו לא נישא בכל אחריות למעשה פריצה ליישום ונטילת תכנים ונתונים ממנו, או שיבושו.
7.3.אין לנו, לעובדינו, למנהלינו, לדירקטורים שלנו ולבעלי מניותינו כל אחריות לנזקים ישירים או עקיפים או תוצאתיים או עונשיים הנובעים משימוש לא מורשה של מאן דהוא ביישום. מלוא הסיכון הנובע מתוך השימוש ביישום לרבות השימוש בתכנים המצויים בו או במוצרים או השירותים המפורסמים בו או המוצעים באמצעותו או בעטיו הוא עליך בלבד, ואין לנו כל אחריות לדבר. בשום מקרה לא נהיה אחראים לכל נזק או הוצאה או הפסד או אי נוחות או אובדן מידע או צער וסבל כתוצאה מהשימוש כאמור.
7.4.את/ה תשפה אותנו, עובדינו, מנהלינו, דירקטורים שלנו ובעלי מניותינו בגין כל תביעה או דרישה של צד ג' הנובעת משימושך ביישום או בכל הנוגע לשירות או מוצר שפורסמו במסגרתו או שפורסמה בקשה לקבלת הצעות במסגרתו או שימוש בהם. אנו נעשה מיטב מאמצינו להודיע לך בהקדם אודות או תביעה או דרישה כאמור, ונאפשר לך להתגונן בפניה. ככל שלא תתגונן/י כנדרש אנו עשויים לעשות כן במקומך ואת/ה תישא בכל הוצאותינו בנדון כמו אף בכל תוצאות ההליך או הפשרה ככל שנגיע אליה בהקשר זה.
7.5.הפרת תנאי שימוש אלו על ידך, תזכה אותנו בתשלום פיצויים בין היתר בהתאם לנזקים, ההפסדים, ההוצאות, הטרחה, ההטרדה, עוגמת הנפש שהוסבה לנו לציבור המשתמשים ביישום ולאחרים.
  
8.שונות

8.1.הנמנעות מלנקוט בצעד כלשהו שאנו זכאים לנקוט בו, לא יהווה ויתור או השתק.
8.2.אם תנאי מתנאי השימוש ביישום זה ימצא כלא תקף או לא אכיף, אזי אותו תנאי יאכף עד להיקף המותר על פי הדין, ואין בכך כדי לפגוע בתוקפם ואכיפותם של יתר תנאי השימוש ביישום זה.
8.3.אנו רשאים מעת לעת לשנות תנאים אלו, אנא בדוק/י את התנאים באופן מתמיד.
8.4.על תנאים אלו יחולו דיני מדינת ישראל, וסמכות השיפוט הבלעדית לדון בתנאים ובכל הקשור לשימושך ובכל הנובע ממנו, נתונה לבתי המשפט במחוז המרכז.
8.5.כל תביעה בין הצדדים בקשר ליישום זה תוגש תוך שנה מיום קרות עילת התביעה.
8.6.אין את/ה רשאי/ת להסב כל זכות שקמה לך כלפינו בקשר ליישום. אנו רשאים להסב זכויותינו וחובותינו לאחרים.
8.7.תנאים אלו ממצים את מלוא ההסכמות בינינו ביחס לשימוש ביישום.

שימוש במיכאל:

1. הגבלת אחריות: החברה אינה נושאת באחריות לכל נזק, ישיר או עקיף, שעלול להיגרם כתוצאה מהשימוש בעצות, המלצות או תכנים כלשהם שמיכאל מספק. המשתמשים מקבלים על עצמם את מלוא האחריות לשימוש במידע ובהמלצות שמיכאל נותן.
2. אי-מתן ייעוץ רפואי או נפשי: מיכאל אינו מהווה תחליף לטיפול מקצועי על ידי איש מקצוע מוסמך בתחום הבריאות הנפשית או הרפואה. כל המידע והתכנים המסופקים על ידי מיכאל נועדו למטרות חינוכיות ואינפורמטיביות בלבד, ואינם מהווים אבחנה, טיפול או מרשם רפואי.
3. אי-הבעת דעה: התכנים, ההמלצות והעצות של מיכאל אינם משקפים בהכרח את דעותיהם או השקפותיהם של החברה, עובדיה, שותפיה או נותני שירותיה. אין לראות בתכנים אלו כתמיכה, קידום או עידוד לנקוט בפעולות או גישות ספציפיות.
4. הודעת מניעת אחריות: החברה, עד כמה שמותר על פי חוק, מתנערת מכל אחריות לגבי דיוק, אמינות, שלמות או זמינות המידע, הייעוץ או התכנים שמיכאל מספק.
5. גילוי נאות לגבי AI: מיכאל הוא מטפל וירטואלי מבוסס בינה מלאכותית. הוא מסוגל להבין ולהגיב לקלט בצורה שנראית אנושית, אך אין לו מודעות, רגשות או יכולת הבנה אנושית אמיתית. האינטראקציות עם מיכאל נועדו להיות תומכות ואינפורמטיביות, אך לא יכולות ולא אמורות לחקות אינטראקציה אנושית אותנטית או ליצור קשר משמעותי.
6. שינויים במדיניות: החברה שומרת לעצמה את הזכות לשנות, לעדכן או לתקן את מדיניות הפרטיות והשימוש הזו בכל עת ועל פי שיקול דעתה הבלעדי. על המשתמשים לבדוק מדי פעם את המדיניות העדכנית ביותר.`;
