import AppText from '@common/components/AppText';
import React from 'react';
import { ScrollView, Text, TouchableOpacity } from 'react-native';
import { scale } from 'react-native-size-matters';
import styled from 'styled-components';

const PrivacyPolicy = ({ navigation }) => {
  const Heading = styled(AppText)`
    font-size: 18px;
    letter-spacing: 1.19px;
    margin-top: 5px;
    padding-horizontal: 20px;
    text-align: left;
  `;
  const PrivacyText = styled(AppText)`
    font-size: 16px;
    letter-spacing: 1px;
    margin-top: 5px;
    line-height: 18px;
    margin-horizontal: 30px;
    text-align: left;
  `;
  return (
    <ScrollView
      style={{
        flex: 1,
        paddingTop: scale(40),
        paddingBottom: scale(40),
        backgroundColor: '#fdedd6',
      }}>
      <TouchableOpacity
        onPress={() => navigation.goBack()}
        style={{
          flexDirection: 'row',
          flex: 1,
          display: 'flex',
          marginHorizontal: scale(20),
        }}>
        <Text
          style={{ fontSize: 30, textAlign: 'right', alignSelf: 'flex-end' }}>
          X
        </Text>
      </TouchableOpacity>
      <Heading bold>מדיניות פרטיות ותנאי שימוש</Heading>
      <PrivacyText>
        בעת שימוש בדף הנחיתה ובאפליקציה נאסף מידע עליך. חלק מהמידע מזהה אותך
        באופן אישי, כלומר בשמך ובכתובתך, זהו המידע שאתה מוסר ביודעין בעת מילוי
        הטופס. חלק מהמידע אינו מזהה אותך אישית ואינו נשמר ביחד עם פרטיך. זהו
        מידע סטטיסטי ומצטבר לדוגמא, העמודים שבהם צפית, העמודים שמהם הגעת וכתובת
        האינטרנט.
      </PrivacyText>
      <Heading bold>מאגר המידע</Heading>
      <PrivacyText>חלק מהנתונים הנאספים ישמרו במאגר המידע של רגע </PrivacyText>
      <Heading bold>השימוש במידע</Heading>
      <PrivacyText>
        השימוש במידע יעשה רק בכפוף למדיניות זו או על פי הוראות כל דין על מנת -
        לשפר את חווית השימוש - להציע לך תכנים רלוונטים - לעדכן בשינויים והתראות
        חשובות - יצירת קשר
      </PrivacyText>
      <Heading bold>דיוור ישיר אלקטרוני</Heading>
      <PrivacyText>
        רגע מעוניינת לשלוח אליך מדי פעם בדואר אלקטרוני מידע פעילותה מידע כזה
        ישוגר אליך רק אם נתת הסכמה מפורשת לכך, ובכל עת תוכל לבטל את הסכמתך
        ולחדול מקבלתו. החברה לא תמסור את פרטיך האישיים למפרסמים
      </PrivacyText>
      <Heading bold>מסירת מידע לצד שלישי</Heading>
      <PrivacyText>
        רגע, לא תעביר לצדדים שלישיים את פרטיך האישיים והמידע שנאסף מפעילותך
      </PrivacyText>
      <Heading bold>קוקיז (עוגיות אינטרנט)</Heading>
      <PrivacyText>
        אתר רגע משתמש ב"עוגיות" )Cookies( לצורך תפעולם השוטף והתקין, ובכלל זה
        כדי לאסוף נתונים סטטיסטיים אודות השימוש באתר, לאימות פרטים, כדי להתאים
        את האתר להעדפותיך האישיות ולצורכי אבטחת מידע. דפדפנים מודרניים כוללים
        אפשרות להימנע מקבלת .Cookies אם אינך יודע כיצד לעשות זאת, בדוק בקובץ
        העזרה של הדפדפן שבו אתה משתמש
      </PrivacyText>
      <Heading bold>אבטחת מידע</Heading>
      <PrivacyText>
        גע מיישמת באתריה מערכות ונהלים עדכניים לאבטחת מידע. בעוד שמערכות ונהלים
        אלה מצמצמים את הסיכונים לחדירה בלתי-מורשית, אין הם מעניקים בטחון מוחלט
      </PrivacyText>
      <Heading bold>תנאי שימוש</Heading>
      <PrivacyText>
        1.1. פרטייך האישיים ו/או מידע אישי ו/או פרטי הזיהוי (להלן: "מידע אישי")
        אשר החברה מקבלת ממך בעת ההזמנה, נועדו לצורך רכישת הספרים לכתובת הדוא"ל
        המבוקשת ללא כל טעויות ו/או תקלות שונות אשר יימנעו ממך לקבל את הפריטים
        שהוזמנו ונרכשו על ידך. 1.2. המידע האישי, כמו גם מידע על רכישות באתר
        (להלן: "המידע"), יישמרו במאגר המידע של האתר בהתאם להוראות חוק הגנת
        הפרטיות, התשל"א – 1981, וייעשה בהם שימוש על פי הוראות סעיף זה ו/או על פי
        הוראות כל דין. 1.3. החברה עושה מאמצים מסחריים רבים על מנת להגן על שלמות
        המידע ואבטחת המידע מפני גישה של צדדים שלישיים. איסוף המידע ושמירתו
        בסודיות נעשים בסביבה מאובטחת- החברה משתמשת בשילוב של טכנולוגיות אבטחה,
        לרבות הגנה על האתר באמצעות טכנולוגיות הצפנה SSL, נוהלי אבטחה ואמצעים
        ארגוניים אחרים בכדי להגן על המידע מפני גישה, ו/או שימוש ו/או גילוי לבלתי
        מורשים בחברה ו/או צדדים שלישיים מכח ההסכם ו/או הדין. 1.4. בנוסף, כפי
        שפורט בהסכם תנאי השימוש סליקת כרטיסי האשראי של רוכשים דרך האתר מתבצעת
        באמצעות ספק הסליקה והחברה אינה שומרת פרטי כרטיסי אשראי שנמסרו על ידי
        משתמשי האתר בשרתיה. 1.5. חלק מן השימושים באתר ו/או השירותים הניתנים באתר
        מצריכים הרשמה אשר במסגרתה תידרש למסור פרטים אישיים, ומבלי לגרוע מכלליות
        האמור לעיל, כגון שמך המלא וכתובת הדוא"ל שלך (להלן:"ההרשמה"). על כן, הינך
        מצהיר בזאת כי הפרטים אישיים אשר נמסרים לחברה במהלך ההרשמה נעשים מרצונך
        החופשי ובהסכמתך. 1.6. החברה תהא רשאית לשלוח אליך מדי פעם בדואר אלקטרוני
        דברי פרסומת בהתאם להוראות חוק התקשורת (בזק ושידורים) (תיקון מס' 40),
        התשס"ח-2008 ("חוק הספאם"). החברה רשאית להשתמש במידע שתמסור באתר – ובמידע
        שתאסוף אודות דפוסי השימוש באתר – לצורך שיפור השירותים באתר ו/או בכל דרך
        אחרת שהיא מציעה, ליצירת קשר איתך במקרה הצורך בהתאם להוראות חוק הספאם, או
        לצורך ניתוח ומסירת מידע סטטיסטי לצדדים שלשיים. על צדדים שלישיים כאמור
        ו/או עובדיהם ו/או מי מטעמם נאסר להשתמש במידע אישי זה לכל מטרה אחרת, מלבד
        האמור בסעיף זה לעיל. 1.7. החברה משתמשת בטכנולוגיית cookies ובטכנולוגיות
        דומות במהותן לצורך תפעולו השוטף והתקין של האתר (להלן ביחד "העוגיות"),
        ובכלל זה בכדי לאסוף נתונים סטטיסטיים אודות השימוש באתר, לאימות פרטים,
        להתאמת האתר להעדפותיך האישיות ולצרכי אבטחת מידע. כאמור, החברה מקדישה
        משאבים ונוקטת באמצעי אבטחה שונים למניעת חדירה למחשבי החברה ו/או מאגר
        המידע של האתר על מנת לסכל פגיעה אפשרית בפרטיות המשתמשים האתר. עם זאת,
        אין החברה יכולה לאבטח את מחשבי החברה ו/או מאגר המידע של האתר אבטחה
        מושלמת מפני חדירות בלתי מורשות ושימוש אסור במידע. על כן, הינך מצהיר בזאת
        כי לא תהיה לך כל טענה ו/או דרישה ו/או תביעה נגדינו ו/או מי מטעם החברה
        עקב חדירות בלתי מורשות כאמור ו/או גילוי ו/או שימוש במידע הנובע מחדירות
        בלתי מורשות כאמור, מכח ההסכם ו/או הדין. אנו ממליצים לך לנקוט בכל אמצעי
        הזהירות האפשריים להגנת המידע בעת פעילותך באינטרנט. לדוגמא, שנה את
        הסיסמאות שלך לעיתים קרובות, השתמש בשילוב של אותיות ומספרים בעת יצירת
        סיסמאות, וודא שאתה משתמש בדפדפן מאובטח. יצוין שאותם "עוגיות" Cookies
        "משואות רשת" (web beacons) הן קבצים גראפיים זעירים בעלי מזהה ייחודי,
        המשובצים בדפי אינטרנט ושתפקידם לסייע באיסוף מידע אודות הצפייה והשימוש
        באתר וכן נתוני קהל (כגון גיל, מין ותחומי עניין) המופקים על בסיס קוד קוד
        Google Analytics . המידע הנאסף איננו מזהה אותך והשימוש שיעשה ב-Cookies
        ובמשואות רשת כפוף למדיניות הפרטיות של Google /אם אתה רוצה לבדוק את
        מדיניות הפרטיות של Google תוכל לעשות כן באמצעות אתרי האינטרנט שלהן ו/או
        בקישור זה. 1.8. החברה אינה מעוניינת לקבל ממך כל תוכן או מידע שהינו סודי
        או מוגן על ידי זכויות כלשהן והינך נדרש להימנע מלהעלות לאתר ולפרסם בו כל
        מידע כאמור. על כן, ההתייחסות לכל תוכן או מידע שתמסור לחברה ו/או תפרסם
        באמצעות האתר או בכל אמצעי אחר לצורך פרסום (למשל בפורומים, תגוביות וכו',
        ככל שישנם) תהיה כאל מידע לא סודי ולא קנייני. דע, כי במשלוח תכנים ומידע
        לפרסום, הנך מקנה לחברה רשיון חינם שאינו מוגבל בזמן, להציג, לשכפל,
        להעתיק, להפיץ, לשווק, לשדר, להעמיד לרשות הציבור ולעשות בתכנים ובמידע כל
        שימוש אחר לפי שיקול דעתה. משמעותו של דבר היא שאינך זכאי, ולא תהיה זכאי
        בעתיד, לכל תשלום שהוא בגין תכנים כלשהם שתמסור לחברהו/או תפרסם באתר. 1.9.
        המידע הנמסר על ידך כפוף להוראות מדיניות הגנת הפרטיות בהסכם ו/או הדין,
        החברה תימנע, ככל האפשר, ממסירת מידע לצדדים שלישיים במודע, למעט לספקים
        וזאת רק על מנת להשלים את פעולות הרכישה שביצעת באתר, אלא אם תהיה מחויבת
        לעשות כן על פי צו שיפוטי ו/או אם תעמוד בפני איום שינקטו כנגדה צעדים
        משפטיים (פליליים או אזרחיים) בגין פעולות שביצעת באתר. במקרה זה רשאית
        החברה למסור את פרטיך לצד הטוען כי נפגע ממך ו/או בהתאם להוראות הצו
        השיפוטי ללא כל הודעה מוקדמת. 1.10.באתר קיימים קישורים אשר מפנים לאתרי
        אינטרנט אחרים. החברה עושה מאמץ לקשר לאתרי אינטרנט אשר לפי מיטב ידיעתה
        אינם פוגעים בפרטיות המשתמשים באתרי אינטרנט האחרים. יחד עם זאת, החברה
        איננה אחראית לתנאי השימוש ו/או למדיניות הגנת הפרטיות באתרי האינטרנט
        האחרים, לתכניהם וכל הקשור או הנובע משימוש בהם. שימושך בקישורים לאתרי
        אינטרנט אחרים ו/או השימוש באתרים אחרים, הינם על אחריותך הבלעדית. 1.11.
        הנך זכאי לעיין במידע שנאסף ומוחזק על ידי החברה בהתאם לתנאי שימוש אלו
        על-פי חוק הגנת הפרטיות, התשמ"א -1981. בנוסף, אם המידע שבמאגרי החברה משמש
        לצורך פניה אישית אליך, בהתבסס על השתייכותך לקבוצת אוכלוסין, שנקבעה על פי
        איפיון אחד או יותר של בני אדם ששמותיהם כלולים במאגר ("פניה בהצעה
        מסחרית"), כי אז אתה זכאי על-פי חוק הגנת הפרטיות, התשמ"א-1981 לדרוש בכתב
        שהמידע המתייחס אליך יימחק ממאגר המידע. החברה תמחק במקרה זה מידע הדרוש לה
        רק כדי לפנות אליך בהצעות מסחריות כאמור לעיל. מידע הדרוש לחברה לשם ניהול
        עסקיה – לרבות תיעוד פעולות מסחריות ואחרות שביצעת באתר החברה – יוסיף
        להישמר בחברה על-פי דין, אך לא ישמש עוד לצורך פניות אליך. 1.12.החברה
        רשאית לשנות מעת לעת את הוראות מדיניות הפרטיות. אם יבוצעו במדיניות זו
        שינויים מהותיים, בהוראות שעניינן השימוש במידע שמסרת, תפורסם על-כך הודעה
        באתר.
      </PrivacyText>
    </ScrollView>
  );
};

export default PrivacyPolicy;
