import { getRandomElementsByDay } from '@utils/rand';
import React from 'react';
import { Text } from 'react-native';

const QUOTES = [
  'בפשטות של הרגע הזה, טמונה האמת של הקיום.',
  'השלום אינו נמצא בעולם החיצוני, אלא בשקט הפנימי.',
  'חבק את ההווה בקבלה, כי זהו הרגע היחיד שבאמת יש לנו.',
  'הצמיחה היא המסע ממי שהיית למי שתבחר להיות.',
  'מיינדפולנס היא אמנות ההיות נוכח לחלוטין, חי לחלוטין.',
  'תנו לעבר ללכת, קבלו את מה שהוא, והאמינו במה שיהיה.',
  'חיה כאילו תמות מחר, למד כאילו תחיה לנצח.',
  'בכל רגע יש לקח ללמוד.',
  'המורה החכם אינו כובל אותך להכנס למעון החכמה שלו, אלא מוביל אותך למפתן ההכרה שלך.',
  'אמנות החיים היא לחיות ברגע הזה.',
  'אדם חייב להיות מוכן לוותר על מי שהוא, כדי להפוך למי שהוא יכול להיות.',
  'החוכמה של החיים מתגלה בקבלה של כל רגע כמו שהוא.',
  'על אדם קודם להנחות את עצמו בדרך שלו. רק לאחר מכן יוכל להנחות אחרים.',
  'היופי של החיים נמצא בפרטים הקטנים.',
  'אהבה היא היכולת לראות את הטוב באחרים, גם כשהם לא רואים אותו בעצמם.',
  'הצלחה אמיתית מגיעה כאשר אתה מצליח לחיות את חייך בדרך שלך.',
  'כל נשימה היא הזדמנות לחדש את עצמנו.',
  'לחיות ברגע הזה הוא לחיות בשלמות.',
  'אינך יכול לבחור את האירועים בחייך אך כן לבחור את ההתייחסות שלך אליהם.',
  'מציאת האושר בתוך הקשיים היא מפתח לחיים משמעותיים.',
];

const Quote = () => {
  return (
    <Text className="mt-4 text-center text-lg italic font-medium text-black">
      - "{getRandomElementsByDay<string>(QUOTES, 1)[0]}"
    </Text>
  );
};

export default Quote;
