export default {
  noSessions: 'Немає елементів',
  welcomeTitle: 'Привіт, даскаво просимо у додатку',
  welcomeSubtitle: 'Це перший в Украіні застосунок з використанням ШІ!!!',
  welcomeDescription:
    'З цим додатком ви подолаєте всі тривоги, покращите свій ментальний стан, почнете краще засинати та підвищите свою продуктивність.',

  sleepIntro: 'Покращити сон',
  stressIntro: 'Зменшити стрес',
  armyIntro: 'Допомога при ПТСР',
  southIntro: 'Покращити роботу мозку',

  male: 'Чоловіча',
  female: 'Жіноча',

  // Tabs
  home: 'Головна',
  courses: 'Документи',
  profile: 'Профіль',
  chat: 'Чати',

  showAll: 'Показати все',
  name: "Ім'я:",
  sex: 'Стать:',
  email: 'Пошта:',
  password: 'Пароль',
};
